# Инструкция
# Демонстрирует, как создавать собственные функции
def instructions():
    """Вывод на экран инструкцию для игрока."""
    print(
        """
        Добропожаловать в игру.
        Чтобы сделать ход, введи число от 0 до 8. Числа однозначно соответствуют
        полям доски - Так как показано ниже
        0 | 1 | 2
        ---------
        3 | 4 | 5
        ---------
        6 | 7 | 8
        Приготовься к бою.\n"""
    )
# Основная часть
print("Это инструкция для игры в 'Крестики-нолики':")
instructions()
